load-test.yml
config:
  target: "http://127.0.0.1"
  phases:
    - name: Warm up the API
      duration: 60
      arrivalRate: 5
      rampTo: 10
    - name: Ramp up to peak load
      duration: 60
      arrivalRate: 10
      rampTo: 50
    - name: Sustained peak load
      duration: 60
      arrivalRate: 100
      rampTo: 500
scenarios:
  - name: Get Home
    flow:
      - get:
          url: "/"